//
//  LGAfterschoolPlanVersion.h
//  LGAfterschoolPlanFramework
//
//  Created by lg on 2019/7/1.
//  Copyright © 2019 lg. All rights reserved.
//

#ifndef LGAfterschoolPlanVersion_h
#define LGAfterschoolPlanVersion_h

/** 版本：1.0.0.12    2019-10-16 */
/**
 1、添加课外计划跳转英语训练资料预览
 */

/** 版本：1.0.0.11    2019-10-15 */
/**
 1、课外计划创建计划弹框点击灰色背景可取消
 2、课外计划词汇学习切换模式不自动开始学习
 */

/** 版本：1.0.0.10    2019-10-11 */
/**
 1、完成课外计划iPad适配
 */

/** 版本：1.0.0.9    2019-9-29 */
/**
 1、删除课外计划带杂音的背景音频
 */

/** 版本：1.0.0.8    2019-9-27 */
/**
 1、课外计划单词详情界面iPad将就适配
 2、修改课外计划每次上拉都是第一页的bug
 3、修改课外计划听音模式释义弹框显示bug
 */

/** 版本：1.0.0.7    2019-9-21 */
/**
 1、新增模块将要退出回调
 */

/** 版本：1.0.0.6    2019-9-9 */
/**
 1、新增对外接口配置进入课外计划详情界面
 */

/** 版本：1.0.0.5    2019-9-5 */
/**
 1、处理课外计划单词学习模式下手机静音模式播放无声问题
 2、处理课外计划单词学习中文翻译没有获取到知识点课件的学习问题
 3、处理课外计划单词学习中文翻译再学习单词通过学习回调处理
 */

/** 版本：1.0.0.4    2019-9-4 */
/**
 1、更新课外计划podfile第三方库版本控制
 2、更新课外计划单词学习当批量获取知识点失败时通过关键字获取知识点问题处理
 */

/** 版本：1.0.0.3    2019-9-3 */
/**
 1、课外计划批量获取知识点课件数据为空时的崩溃问题处理
 */

/** 版本：1.0.0.2    2019-9-2 */

/** 版本：1.0.0.1    2019-8-15 */

#endif /* LGAfterschoolPlanVersion_h */
